### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_private_dns_resolver_forwarding_rule.corp_mycompany_com will be created
+   resource "azurerm_private_dns_resolver_forwarding_rule" "corp_mycompany_com" {
+       dns_forwarding_ruleset_id = (known after apply)
+       domain_name               = "corp.mycompany.com."
+       enabled                   = true
+       id                        = (known after apply)
+       name                      = "corp_mycompany_com"

+       target_dns_servers {
+           ip_address = "10.0.0.3"
+           port       = 53
        }
+       target_dns_servers {
+           ip_address = "10.0.0.4"
+           port       = 53
        }
    }

  # azurerm_resource_group.dns_resolver will be created
+   resource "azurerm_resource_group" "dns_resolver" {
+       id       = (known after apply)
+       location = "westeurope"
+       name     = (known after apply)
    }

  # azurerm_subnet.inbound will be created
+   resource "azurerm_subnet" "inbound" {
+       address_prefixes                               = [
+           "10.1.0.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = (known after apply)
+       enforce_private_link_service_network_policies  = (known after apply)
+       id                                             = (known after apply)
+       name                                           = "snet-dns-resolver-inbound"
+       private_endpoint_network_policies_enabled      = (known after apply)
+       private_link_service_network_policies_enabled  = (known after apply)
+       resource_group_name                            = (known after apply)
+       virtual_network_name                           = "vnet-dns-resolver"

+       delegation {
+           name = "Microsoft.Network.dnsResolvers"

+           service_delegation {
+               actions = [
+                   "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
+               name    = "Microsoft.Network/dnsResolvers"
            }
        }
    }

  # azurerm_subnet.outbound will be created
+   resource "azurerm_subnet" "outbound" {
+       address_prefixes                               = [
+           "10.1.1.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = (known after apply)
+       enforce_private_link_service_network_policies  = (known after apply)
+       id                                             = (known after apply)
+       name                                           = "snet-dns-resolver-outbound"
+       private_endpoint_network_policies_enabled      = (known after apply)
+       private_link_service_network_policies_enabled  = (known after apply)
+       resource_group_name                            = (known after apply)
+       virtual_network_name                           = "vnet-dns-resolver"

+       delegation {
+           name = "Microsoft.Network.dnsResolvers"

+           service_delegation {
+               actions = [
+                   "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
+               name    = "Microsoft.Network/dnsResolvers"
            }
        }
    }

  # azurerm_virtual_network.vnet will be created
+   resource "azurerm_virtual_network" "vnet" {
+       address_space       = [
+           "10.1.0.0/23",
        ]
+       dns_servers         = (known after apply)
+       guid                = (known after apply)
+       id                  = (known after apply)
+       location            = "westeurope"
+       name                = "vnet-dns-resolver"
+       resource_group_name = (known after apply)
+       subnet              = (known after apply)
    }

  # random_id.rg will be created
+   resource "random_id" "rg" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 8
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # module.dns-private-resolver.azurerm_private_dns_resolver.private_dns_resolver will be created
+   resource "azurerm_private_dns_resolver" "private_dns_resolver" {
+       id                  = (known after apply)
+       location            = "westeurope"
+       name                = "test-dns-private-resolver"
+       resource_group_name = (known after apply)
+       tags                = {
+           "Configuration" = "Terraform"
        }
+       virtual_network_id  = (known after apply)
    }

  # module.dns-private-resolver.azurerm_private_dns_resolver_dns_forwarding_ruleset.forwarding_ruleset["outbound-default-ruleset"] will be created
+   resource "azurerm_private_dns_resolver_dns_forwarding_ruleset" "forwarding_ruleset" {
+       id                                         = (known after apply)
+       location                                   = "westeurope"
+       name                                       = "default-ruleset"
+       private_dns_resolver_outbound_endpoint_ids = (known after apply)
+       resource_group_name                        = (known after apply)
+       tags                                       = {
+           "Configuration" = "Terraform"
        }
    }

  # module.dns-private-resolver.azurerm_private_dns_resolver_inbound_endpoint.private_dns_resolver_inbound_endpoint["inbound"] will be created
+   resource "azurerm_private_dns_resolver_inbound_endpoint" "private_dns_resolver_inbound_endpoint" {
+       id                      = (known after apply)
+       location                = "westeurope"
+       name                    = "inbound"
+       private_dns_resolver_id = (known after apply)
+       tags                    = {
+           "Configuration" = "Terraform"
        }

+       ip_configurations {
+           private_ip_address           = (known after apply)
+           private_ip_allocation_method = "Dynamic"
+           subnet_id                    = (known after apply)
        }
    }

  # module.dns-private-resolver.azurerm_private_dns_resolver_outbound_endpoint.private_dns_resolver_outbound_endpoint["outbound"] will be created
+   resource "azurerm_private_dns_resolver_outbound_endpoint" "private_dns_resolver_outbound_endpoint" {
+       id                      = (known after apply)
+       location                = "westeurope"
+       name                    = "outbound"
+       private_dns_resolver_id = (known after apply)
+       subnet_id               = (known after apply)
+       tags                    = {
+           "Configuration" = "Terraform"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
</details>